Revit 2027 API
CurveByPointsArray.Append Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	CurveByPoints item
)
Public Overridable Sub Append (
	item As CurveByPoints
)
public:
virtual void Append(
	CurveByPoints^ item
)
abstract Append :
        item : CurveByPoints -> unit
override Append :
        item : CurveByPoints -> unit
Parameters
item CurveByPoints
See Also
Reference
CurveByPointsArray Class
Autodesk.Revit.DB Namespace